{
    "words":[
        {"baleboste": "A good homemaker, a woman who’s in charge of her home and will make sure you remember it."},
        {"bissel": "Or bisl – a little bit."},
        {"bubbe": "Or bobe. It means Grandmother, and bobeshi is the more affectionate form. Bubele is a similarly affectionate word, though it isn’t in Yiddish dictionaries."},
        {"bupkes": "Not a word for polite company. Bubkes or bobkes may be related to the Polish word for “beans”, but it really means “goat droppings” or “horse droppings.” It’s often used by American Jews for “trivial, worthless, useless, a ridiculously small amount” – less than nothing, so to speak. “After all the work I did, I got bupkes!”"},
        {"chutzpah": "Or khutspe. Nerve, extreme arrogance, brazen presumption. In English, chutzpah often connotes courage or confidence, but among Yiddish speakers, it is not a compliment."},
        {"feh!": "An expression of disgust or disapproval, representative of the sound of spitting."},
        {"glitch": "Or glitsh. Literally “slip,” “skate,” or “nosedive,” which was the origin of the common American usage as “a minor problem or error.”"},
        {"gornisht": "More polite than bupkes, and also implies a strong sense of nothing; used in phrases such as 'gornisht helfn' (beyond help)."},
        {"goy": "A non-Jew, a Gentile. As in Hebrew, one Gentile is a goy, many Gentiles are goyim, the non-Jewish world in general is “the goyim.” Goyish is the adjective form. Putting mayonnaise on a pastrami sandwich is goyish. Putting mayonnaise on a pastrami sandwich on white bread is even more goyish."},
        {"kibbitz": "In Yiddish, it’s spelled kibets, and it’s related to the Hebrew “kibbutz” or “collective.” But it can also mean verbal joking, which after all is a collective activity. It didn’t originally mean giving unwanted advice about someone else’s game – that’s an American innovation."},
        {"klutz": "Or better yet, klots. Literally means “a block of wood,” so it’s often used for a dense, clumsy or awkward person. See schlemiel."},
        {"kosher": "Something that’s acceptable to Orthodox Jews, especially food. Other Jews may also “eat kosher” on some level but are not required to. Food that Orthodox Jews don’t eat – pork, shellfish, etc. – is called traif. An observant Jew might add, “Both pork and shellfish are doubtlessly very tasty. I simply am restricted from eating it.” In English, when you hear something that seems suspicious or shady, you might say, “That doesn’t sound kosher.”"},
        {"kvetsh": "In popular English, kvetch means “complain, whine or fret,” but in Yiddish, kvetsh literally means “to press or squeeze,” like a wrong-sized shoe. Reminds you of certain chronic complainers, doesn’t it? But it’s also used on Yiddish web pages for “click” (Click Here)."},
        {"maven": "Pronounced meyven. An expert, often used sarcastically."},
        {"Mazel Tov": "Or mazltof. Literally “good luck,” (well, literally, “good constellation”) but it’s a congratulation for what just happened, not a hopeful wish for what might happen in the future. When someone gets married or has a child or graduates from college, this is what you say to them. It can also be used sarcastically to mean “it’s about time,” as in “It’s about time you finished school and stopped sponging off your parents.”"},
        {"mentsh": "An honorable, decent person, an authentic person, a person who helps you when you need help. Can be a man, woman or child."},
        {"mishegas": "Insanity or craziness. A meshugener is a crazy man. If you want to insult someone, you can ask them, ”Does it hurt to be crazy?”"},
        {"mishpocheh": "Or mishpokhe or mishpucha. It means “family,” as in “Relax, you’re mishpocheh. I’ll sell it to you at wholesale.”"},
        {"nosh": "Or nash. To nibble; a light snack, but you won’t be light if you don’t stop noshing. Can also describe plagarism, though not always in a bad sense; you know, picking up little pieces for yourself."},
        {"nu": "A general word that calls for a reply. It can mean, “So?” “Huh?” “Well?” “What’s up?” or “Hello?”"},
        {"oy vey": "Exclamation of dismay, grief, or exasperation. The phrase “oy vey iz mir” means “Oh, woe is me.” “Oy gevalt!” is like oy vey, but expresses fear, shock or amazement. When you realize you’re about to be hit by a car, this expression would be appropriate."},
        {"plotz": "Or plats. Literally, to explode, as in aggravation. “Well, don’t plotz!” is similar to “Don’t have a stroke!” or “Don’t have a cow!” Also used in expressions such as, “Oy, am I tired; I just ran the four-minute mile. I could just plotz.” That is, collapse."},
        {"shalom": "It means “deep peace,” and isn’t that a more meaningful greeting than “Hi, how are ya?”"},
        {"shlep": "To drag, traditionally something you don’t really need; to carry unwillingly. When people “shlep around,” they are dragging themselves, perhaps slouchingly. On vacation, when I’m the one who ends up carrying the heavy suitcase I begged my wife to leave at home, I shlep it."},
        {"shlemiel": "A clumsy, inept person, similar to a klutz (also a Yiddish word). The kind of person who always spills his soup."},
        {"schlock": "Cheap, shoddy, or inferior, as in, “I don’t know why I bought this schlocky souvenir.”"},
        {"shlimazel": "Someone with constant bad luck. When the shlemiel spills his soup, he probably spills it on the shlimazel. Fans of the TV sitcom “Laverne and Shirley” remember these two words from the Yiddish-American hopscotch chant that opened each show."},
        {"shmendrik": "A jerk, a stupid person, popularized in The Last Unicorn and Welcome Back Kotter."},
        {"shmaltzy": "Excessively sentimental, gushing, flattering, over-the-top, corny. This word describes some of Hollywood’s most famous films. From shmaltz, which means chicken fat or grease."},
        {"shmooze": "Chat, make small talk, converse about nothing in particular. But at Hollywood parties, guests often schmooze with people they want to impress."},
        {"schmuck": "Often used as an insulting word for a self-made fool, but you shouldn’t use it in polite company at all, since it refers to male anatomy."},
        {"spiel": "A long, involved sales pitch, as in, “I had to listen to his whole spiel before I found out what he really wanted.” From the German word for play."},
        {"shikse": "A non-Jewish woman, all too often used derogatorily. It has the connotation of “young and beautiful,” so referring to a man’s Gentile wife or girlfriend as a shiksa implies that his primary attraction was her good looks. She is possibly blonde. A shagetz or sheygets means a non-Jewish boy, and has the connotation of a someone who is unruly, even violent."},
        {"shmutz": "Or shmuts. Dirt – a little dirt, not serious grime. If a little boy has shmutz on his face, and he likely will, his mother will quickly wipe it off. It can also mean dirty language. It’s not nice to talk shmutz about shmutz. A current derivation, “schmitzig,” means a “thigamabob” or a “doodad,” but has nothing to do with filth."},
        {"shtick": "Something you’re known for doing, an entertainer’s routine, an actor’s bit, stage business; a gimmick often done to draw attention to yourself."},
        {"tchatchke": "Or tshatshke. Knick-knack, little toy, collectible or giftware. It also appears in sentences such as, “My brother divorced his wife for some little tchatchke.” You can figure that one out."},
        {"tsuris": "Or tsores. Serious troubles, not minor annoyances. Plagues of lice, gnats, flies, locusts, hail, death… now, those were tsuris."},
        {"tuches": "Rear end, bottom, backside, buttocks. In proper Yiddish, it’s spelled tuchis or tuches or tokhis, and was the origin of the American slang word tush."},
        {"yente": "Female busybody or gossip. At one time, high-class parents gave this name to their girls (after all, it has the same root as “gentle”), but it gained the Yiddish meaning of “she-devil”. The matchmaker in “Fiddler on the Roof” was named Yente (and she certainly was a yente though maybe not very high-class), so many people mistakenly think that yente means matchmaker."},
        {"yiddisher kop": "Smart person. Literally means “Jewish head.” I don’t want to know what goyisher kop means."}]
}